vim.g.dashboard_default_executive ='telecsope'

vim.g.dashboard_custom_section = {
    a = {description = {'  Recent Files       '}, command = 'Telescope oldfiles'},
    b = {description = {'  Find File          '}, command = 'Telescope find_files'},
    c = {description = {'  Search Text        '}, command = 'Telescope live_grep'},
    d = {description = {'  Config             '}, command = 'edit ~/.config/nvim/init.lua'},
}
--vim.g.dashboard_custom_footer = {"You're perfect!"}
--vim.g.dashboard_custom_footer = {"ᑐ ᑌ ᑎ ᕮ"}
vim.g.dashboard_custom_footer = {"你背朝太阳,就只能看到自己的影子————纪伯伦"}

vim.g.dashboard_custom_header = {
    [[              ...  .......          ]],
    [[         ....................       ]],
    [[    ..'........................     ]],
    [[ ...,'.......'.., .........'....    ]],
    [[  .'......,. ;'., '..'.......'.'.   ]],
    [[ .'.,'.''.;..,'.. .  ...'....','..  ]],
    [[..''.'.''''.....        .,'....;'.. ]],
    [[..',.......'. .        ..';'..','...]],
    [[ ....''..  ..        .....;,..','...]],
    [[  . .....           ......,..';,....]],
    [[      .'.         ....  ... ,,'.....]],
    [[      .,..             .....,'..... ]],
    [[     .'''.             ...'......   ]],
    [[     ..'..'.          ... ......    ]],
    [[       . '.'..             ..       ]],
    [[         ......           .         ]],
}
--vim.g.dashboard_custom_header = {
--  [[     ⢰⡟⣡⡟⣱⣿⡿⠡⢛⣋⣥⣴⣌⢿⣿⣿⣿⣿⣷⣌⠻⢿⣿⣿⣿⣿⣿⣿    ]],
--  [[     ⠏⢼⡿⣰⡿⠿⠡⠿⠿⢯⣉⠿⣿⣿⣿⣿⣿⣿⣷⣶⣿⣦⣍⠻⢿⣿⣿⣿    ]],
--  [[     ⣼⣷⢠⠀⠀⢠⣴⡖⠀⠀⠈⠻⣿⡿⣿⣿⣿⣿⣿⣛⣯⣝⣻⣿⣶⣿⣿⣿    ]],
--  [[     ⣿⡇⣿⡷⠂⠈⡉⠀⠀⠀⣠⣴⣾⣿⣿⣿⣿⣿⣍⡤⣤⣤⣤⡀⠀⠉⠛⠿    ]],
--  [[     ⣿⢸⣿⡅⣠⣬⣥⣤⣴⣴⣿⣿⢿⣿⣿⣿⣿⣿⣟⡭⡄⣀⣉⡀⠀⠀⠀⠀    ]],
--  [[     ⡟⣿⣿⢰⣿⣿⣿⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣶⣦⣈⠀⠀⠀⢀⣶    ]],
--  [[     ⡧⣿⡇⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣾⣿    ]],
--  [[     ⡇⣿⠃⣿⣿⣿⣿⣿⠛⠛⢫⣿⣿⣻⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿    ]],
--  [[     ⡇⣿⠘⡇⢻⣿⣿⣿⡆⠀⠀⠀⠀⠈⠉⠙⠻⠏⠛⠻⣿⣿⣿⣿⣿⣭⡾⢁    ]],
--  [[     ⡇⣿⠀⠘⢿⣿⣿⣿⣧⢠⣤⠀⡤⢀⣠⣀⣀⠀⠀⣼⣿⣿⣿⣿⣿⠟⣁⠉    ]],
--  [[     ⣧⢻⠀⡄⠀⠹⣿⣿⣿⡸⣿⣾⡆⣿⣿⣿⠿⣡⣾⣿⣿⣿⣿⡿⠋⠐⢡⣶    ]],
--  [[     ⣿⡘⠈⣷⠀⠀⠈⠻⣿⣷⣎⠐⠿⢟⣋⣤⣾⣿⣿⣿⡿⠟⣩⠖⢠⡬⠈⠀    ]],
--  [[     ⣿⣧⠁⢻⡇⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⠿⠟⠋⠁⢀⠈⢀⡴⠈⠁⠀⠀    ]],
--  [[     ⠻⣿⣆⠘⣿⠀⠀  ⠀⠈⠙⠛⠋⠉⠀⠀⠀⠀⡀⠤⠚⠁         ]],
--}
-- 'https://github.com/glepnir/dashboard-nvim'
-- 'https://www.youtube.com/watch?v=f4m0D3ACsjI'
